In this exercise weâ€™re going to use the HR database.

The HR database consists of a single table - employees, providing details about 1,000 employees working in a global tech-company

In [1]:
import sqlalchemy
import numpy as np
import pandas as pd

In [2]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:root@localhost:3306/hr')
engine

Engine(mysql+pymysql://root:***@localhost:3306/hr)

In [3]:
table = """show tables from hr"""
pd.read_sql(table,engine)

  Tables_in_hr
0    employees

In [4]:
data = """select * from employees"""
pd.read_sql(data,engine)

,id,first_name,last_name,gender,country,city,marital_status,phone_number,hire_date,birth_date,job_title,salary,department_id,manager_id,division_name
0,1,Wenda,Reame,Male,Indonesia,Babat,None,130-506-5536,2018-07-24,1976-03-05,CEO,24078.0,10,NaN,None
1,2,Gregor,Salery,Female,Indonesia,Sokobanteng,single,698-466-0561,2002-03-25,1963-09-02,VP,23314.0,70,1.0,None
2,3,Keriann,Mohamed,Male,United States,Tyler,divorced,903-529-6571,2011-10-15,1986-06-20,VP,22136.0,60,1.0,None
3,4,Richy,Frankiss,Male,Indonesia,Long Loreh,separated,637-954-0567,2006-01-06,1986-11-27,VP,8307.0,40,1.0,None
4,5,Ephraim,Maulin,Female,Russia,Chernyshkovskiy,None,131-693-5437,2002-06-30,1964-01-06,VP,11281.0,40,1.0,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Laney,Pepon,Female,China,Xinyan,divorced,736-533-3034,2014-06-22,1968-09-30,Web Designer IV,11759.0,30,9.0,Marketing
996,997,Elbertine,Coe,Female,China,Yongning,divorced,520-273-4178,2014-08-01,1975-12-26,Registered Nurse,12052.0,20,9.0,Marketing
997,998,Daffy,Clitherow,Male,Indonesia,Kolirerek,widowed,864-978-4996,2011-02-25,1978-04-22,Marketing Manager,13924.0,50,9.0,Marketing
998,999,Brunhilda,Wrangle,Male,Niger,Tessaoua,divorced,195-321-2412,2002-12-10,1972-12-02,Recruiting Manager,7838.0,100,9.0,Marketing
999,1000,Anette,Bourdice,Male,Russia,Kukushtan,single,540-645-7143,2001-11-15,1974-08-13,Senior Editor,14234.0,80,9.0,Marketing

## Display the id, first name in lowercase and last name in uppercase, for all employees whose employee number is in the range between 80 and 150.

In [5]:
q1 = """
select id, lcase(first_name) as first_name, ucase(last_name) as last_name
from employees
where id between 80 and 150
"""
df1 = pd.read_sql(q1,engine)
df1

     id first_name     last_name
0    80      perry        ROYSTE
1    81  catharina     DE SANTOS
2    82     sianna        SYWELL
3    83     kameko         TRUDE
4    84    emelina      GIBBETTS
..  ...        ...           ...
66  146       burk  DE CLAIRMONT
67  147    abagail           CUD
68  148    vassily         EKELL
69  149    pacorro        KILJAN
70  150   claudius         CATER

[71 rows x 3 columns]

## For each employee, display the:

    a. first name

    b. last name

    c. email address - The email address will be composed of the first letter of first name, concatenated with the three 
    first letters of last name, concatenated with @gmail.com.

In [6]:
q2 = """
select first_name, last_name, concat(substr(first_name,1,1),substr(last_name,1,3),"@gmail.com") as e_mail
from employees
"""
df2 = pd.read_sql(q2,engine)
df2

    first_name  last_name          e_mail
0        Wenda      Reame  WRea@gmail.com
1       Gregor     Salery  GSal@gmail.com
2      Keriann    Mohamed  KMoh@gmail.com
3        Richy   Frankiss  RFra@gmail.com
4      Ephraim     Maulin  EMau@gmail.com
..         ...        ...             ...
995      Laney      Pepon  LPep@gmail.com
996  Elbertine        Coe  ECoe@gmail.com
997      Daffy  Clitherow  DCli@gmail.com
998  Brunhilda    Wrangle  BWra@gmail.com
999     Anette   Bourdice  ABou@gmail.com

[1000 rows x 3 columns]

## Repeat the last query, only this time present the values of Email in lowercase

In [7]:
q3 = """
select first_name, last_name, concat(lcase(substr(first_name,1,1)),lcase(substr(last_name,1,3)),"@gmail.com") as e_mail
from employees
"""
df3 = pd.read_sql(q3,engine)
df3

    first_name  last_name          e_mail
0        Wenda      Reame  wrea@gmail.com
1       Gregor     Salery  gsal@gmail.com
2      Keriann    Mohamed  kmoh@gmail.com
3        Richy   Frankiss  rfra@gmail.com
4      Ephraim     Maulin  emau@gmail.com
..         ...        ...             ...
995      Laney      Pepon  lpep@gmail.com
996  Elbertine        Coe  ecoe@gmail.com
997      Daffy  Clitherow  dcli@gmail.com
998  Brunhilda    Wrangle  bwra@gmail.com
999     Anette   Bourdice  abou@gmail.com

[1000 rows x 3 columns]

## Write a query to display the id, first_name, last_name and phone_number.In each phone_number replace all dashes ('-') with dots ('.')

In [8]:
q4 ="""
select id, first_name, last_name, replace(phone_number,"-",".") as phone_number
from employees
"""
df4 = pd.read_sql(q4,engine)
df4

       id first_name  last_name  phone_number
0       1      Wenda      Reame  130.506.5536
1       2     Gregor     Salery  698.466.0561
2       3    Keriann    Mohamed  903.529.6571
3       4      Richy   Frankiss  637.954.0567
4       5    Ephraim     Maulin  131.693.5437
..    ...        ...        ...           ...
995   996      Laney      Pepon  736.533.3034
996   997  Elbertine        Coe  520.273.4178
997   998      Daffy  Clitherow  864.978.4996
998   999  Brunhilda    Wrangle  195.321.2412
999  1000     Anette   Bourdice  540.645.7143

[1000 rows x 4 columns]

## Write a query to display the id, first_name, last_name, job_title, department_id for employees with length of job_title greater than 35 characters

In [9]:
q5 ="""
select id, first_name, last_name, job_title, department_id,
       length(job_title) as title_length     #(length(job_title) as title_length) not necessary in mysql 
from employees
where length(job_title) > 35
"""
df5 = pd.read_sql(q5,engine)
df5

,id,first_name,last_name,job_title,department_id,title_length
0,55,Melitta,Roll,Business Systems Development Analyst,100,36
1,157,Rees,Imms,Business Systems Development Analyst,70,36
2,261,Cordy,Burgot,Business Systems Development Analyst,30,36
3,303,Steffie,McCuthais,Business Systems Development Analyst,100,36
4,341,Eimile,Reboul,Business Systems Development Analyst,20,36
5,388,Inigo,Luberto,Business Systems Development Analyst,40,36
6,695,Benedicta,Heigold,Business Systems Development Analyst,100,36
7,786,Roosevelt,Dampier,Business Systems Development Analyst,80,36
8,913,Persis,Quarmby,Business Systems Development Analyst,30,36

## For each employee, display :

    a. first_name

    b. salary

    c. salary after a raise of 12% (salary * 1.12)

    d. salary after a raise of 12%, expressed as a whole number 

    e. salary after a raise of 12%, rounded down to the nearest whole number

In [10]:
q6 ="""
select first_name, salary, (salary * 1.12) as increased_salary, 
        floor(salary * 1.12) as floor_salary,round(salary * 1.12) as round_salary
from employees
"""
df6 = pd.read_sql(q6,engine)
df6

    first_name   salary  increased_salary  floor_salary  round_salary
0        Wenda  24078.0          26967.36       26967.0       26967.0
1       Gregor  23314.0          26111.68       26111.0       26112.0
2      Keriann  22136.0          24792.32       24792.0       24792.0
3        Richy   8307.0           9303.84        9303.0        9304.0
4      Ephraim  11281.0          12634.72       12634.0       12635.0
..         ...      ...               ...           ...           ...
995      Laney  11759.0          13170.08       13170.0       13170.0
996  Elbertine  12052.0          13498.24       13498.0       13498.0
997      Daffy  13924.0          15594.88       15594.0       15595.0
998  Brunhilda   7838.0           8778.56        8778.0        8779.0
999     Anette  14234.0          15942.08       15942.0       15942.0

[1000 rows x 5 columns]

## Write a query to display:

    a. first_name

    b. hire_date

    c. hire_date plus 10 days

    d. hire_date plus 1 month

    e. Difference in days between current date and hire_date

In [11]:
q7 ="""
select first_name, hire_date, date_add(hire_date,interval 10 day) as "plus 10 days",
        date_add(hire_date,interval 1 month) as "plus 1 month", timestampdiff(day,hire_date,current_date()) as days_since_hired
from employees"""
df7 = pd.read_sql(q7,engine)
df7

    first_name   hire_date plus 10 days plus 1 month  days_since_hired
0        Wenda  2018-07-24   2018-08-03   2018-08-24              1159
1       Gregor  2002-03-25   2002-04-04   2002-04-25              7124
2      Keriann  2011-10-15   2011-10-25   2011-11-15              3633
3        Richy  2006-01-06   2006-01-16   2006-02-06              5741
4      Ephraim  2002-06-30   2002-07-10   2002-07-30              7027
..         ...         ...          ...          ...               ...
995      Laney  2014-06-22   2014-07-02   2014-07-22              2652
996  Elbertine  2014-08-01   2014-08-11   2014-09-01              2612
997      Daffy  2011-02-25   2011-03-07   2011-03-25              3865
998  Brunhilda  2002-12-10   2002-12-20   2003-01-10              6864
999     Anette  2001-11-15   2001-11-25   2001-12-15              7254

[1000 rows x 5 columns]

## Write a query to display the first_name, last_name, birth_date, and age for each employee

In [12]:
q8 ="""
select first_name, last_name, birth_date, timestampdiff(year,birth_date,current_date()) as age
from employees"""

df8 = pd.read_sql(q8,engine)
df8

    first_name  last_name  birth_date  age
0        Wenda      Reame  1976-03-05   45
1       Gregor     Salery  1963-09-02   58
2      Keriann    Mohamed  1986-06-20   35
3        Richy   Frankiss  1986-11-27   34
4      Ephraim     Maulin  1964-01-06   57
..         ...        ...         ...  ...
995      Laney      Pepon  1968-09-30   52
996  Elbertine        Coe  1975-12-26   45
997      Daffy  Clitherow  1978-04-22   43
998  Brunhilda    Wrangle  1972-12-02   48
999     Anette   Bourdice  1974-08-13   47

[1000 rows x 4 columns]

## Write a query to display the first_name, last_name, and birth_date for employees who were born on the same day and month as today.

For example: if today is 2021-02-15, we are looking for all employees born on February 15th, regardless the year

Note - depends on the current date, this query may or may not return any results.

In [13]:
pd.read_sql("select current_date()",engine)

  current_date()
0     2021-09-25

In [14]:
q9 = """
select first_name, last_name, birth_date
from employees
where month(current_date()) = month(birth_date) and day(current_date()) = day(birth_date)
"""
df9 =pd.read_sql(q9,engine)
df9

  first_name last_name  birth_date
0       Lula    Rossin  1974-09-25
1    Melissa  Hallahan  1971-09-25

## Write a query to display the id, first_name, marital_status, and salary for employees with no marital_status or salary

In [16]:
q10="""
select id, first_name, marital_status, salary
from employees
where marital_status is null or salary is null
"""
df10=pd.read_sql(q10,engine)
df10

     id first_name marital_status   salary
0     1      Wenda           None  24078.0
1     5    Ephraim           None  11281.0
2    55    Melitta       divorced      NaN
3    58  Armstrong           None  13045.0
4   157       Rees         single      NaN
5   202      Ahmed           None   9597.0
6   208      Vinni           None   9207.0
7   261      Cordy       divorced      NaN
8   303    Steffie      separated      NaN
9   341     Eimile        widowed      NaN
10  388      Inigo         single      NaN
11  447    Marshal           None  16372.0
12  695  Benedicta         single      NaN
13  786  Roosevelt       divorced      NaN
14  800      Marty           None   7690.0
15  863       Luke           None  19291.0
16  913     Persis        married      NaN

## Repeat your last query, only this time:

    a. replace all marital_status NULL values with 'Unknown Status'

    b. replace all salary NULL values with 0

In [18]:
q11 ="""
select id, first_name, ifnull(marital_status,"Unknown Status") as marital_status, ifnull(salary,0) as salary
from employees
"""
df11=pd.read_sql(q11,engine)
df11

       id first_name  marital_status  salary
0       1      Wenda  Unknown Status   24078
1       2     Gregor          single   23314
2       3    Keriann        divorced   22136
3       4      Richy       separated    8307
4       5    Ephraim  Unknown Status   11281
..    ...        ...             ...     ...
995   996      Laney        divorced   11759
996   997  Elbertine        divorced   12052
997   998      Daffy         widowed   13924
998   999  Brunhilda        divorced    7838
999  1000     Anette          single   14234

[1000 rows x 4 columns]

## Write a query to display first_name, last_name, salary, and a new column (name it 'sal_grades') containing values based on the following logic:

    a. For salaries between 0 and 500 -> Grade A

    b. For salaries between 5001 and 15000 -> Grade B

    c. For salaries between 15001 and 20000 -> Grade C

    d. Else -> Grade D

In [20]:
q12="""
select first_name,last_name,salary,
case
    when salary between 0 and 500 then "grade A"
    when salary between 5001 and 15000 then "grade B"
    when salary between 15001 and 20000 then "grade C"
    else "grade D"
end as "sal_grades"
from employees
"""
df12=pd.read_sql(q12,engine)
df12

    first_name  last_name   salary sal_grades
0        Wenda      Reame  24078.0    grade D
1       Gregor     Salery  23314.0    grade D
2      Keriann    Mohamed  22136.0    grade D
3        Richy   Frankiss   8307.0    grade B
4      Ephraim     Maulin  11281.0    grade B
..         ...        ...      ...        ...
995      Laney      Pepon  11759.0    grade B
996  Elbertine        Coe  12052.0    grade B
997      Daffy  Clitherow  13924.0    grade B
998  Brunhilda    Wrangle   7838.0    grade B
999     Anette   Bourdice  14234.0    grade B

[1000 rows x 4 columns]

## Write a query to display first_name, last_name, birth_date, age, and a new column (name it 'age_grades') containing values based on the following logic:

    a. For ages between 0 and 20 -> 0-20

    b. For age between 21 and 40 -> 21-40

    c. For age between 41 and 60 -> 41-60

    d. Else -> 60+

In [ ]:
timestampdiff(year,birth_date,current_date()) as age

In [25]:
q13="""
select first_name,last_name,birth_date,timestampdiff(year,birth_date,current_date()) as "age",
case
    when timestampdiff(year,birth_date,current_date()) between 0 and 20 then "0-20"
    when timestampdiff(year,birth_date,current_date()) between 21 and 40 then "21-40"
    when timestampdiff(year,birth_date,current_date()) between 41 and 60 then "41-60"
    else "60+"
end as "age_grades"
from employees
"""
df13=pd.read_sql(q13,engine)
df13

    first_name  last_name  birth_date  age age_grades
0        Wenda      Reame  1976-03-05   45      41-60
1       Gregor     Salery  1963-09-02   58      41-60
2      Keriann    Mohamed  1986-06-20   35      21-40
3        Richy   Frankiss  1986-11-27   34      21-40
4      Ephraim     Maulin  1964-01-06   57      41-60
..         ...        ...         ...  ...        ...
995      Laney      Pepon  1968-09-30   52      41-60
996  Elbertine        Coe  1975-12-26   45      41-60
997      Daffy  Clitherow  1978-04-22   43      41-60
998  Brunhilda    Wrangle  1972-12-02   48      41-60
999     Anette   Bourdice  1974-08-13   47      41-60

[1000 rows x 5 columns]